Repository: MyPiTech/LandedMVC
Catalog: Resources/Res.*.resx
Languages: es

# FormContactError
source: An error occurred. The email was not sent.
es: Se produjo un error. El correo electrónico no fue enviado.

# FormContactMessage
source: Your Message
es: Tu Mensaje

# FormContactName
source: Your Name
es: Su Nombre

# FormContactNotify
source: Sending email...
es: Enviando correo electrónico...

# FormContactRequiredMessage
source: Please enter a message.
es: Por favor ingrese un mensaje.

# FormContactRequiredName
source: Please enter a name.
es: Por favor ingrese un nombre.

# FormContactSend
source: Send
es: Enviar

# FormContactSuccess
source: Email sent successfully.
es: Correo electrónico enviado correctamente.

# HeaderBio
source: I am self-taught.
es: Soy autodidacta.

# HeaderContact
source: Lets talk...
es: Hablemos...

# HeaderSplash
source: The future has landed
es: El futuro ha aterrizado

# HeaderStory
source: I love riding
es: Me encanta montar

# HeaderTech
source: On to the fun tech stuff.
es: Pasemos a las cosas divertidas sobre tecnología.

# HeaderTechEvents
source: Events
es: Eventos

# HeaderTechUsers
source: Users
es: Usuarios

# HeaderWelcome
source: Hello!
es: ¡Hola!

# LinkBio
source: Bio/Resume
es: Biografía/Currículum

# NavAPI
source: API Swagger UI
es: Interfaz de usuario API Swagger

# NavAPIRepo
source: API Repository
es: Repositorio API

# NavContactMe
source: Contact Me
es: Contacta Conmigo

# NavEvents
source: Events
es: Eventos

# NavHome
source: Home
es: Hogar

# NavNext
source: Next
es: Próximo

# NavOtherProjects
source: My Other Projects
es: Mis Otros Proyectos

# NavRepos
source: Repositories
es: Repositorios

# NavResume
source: Resume/Bio
es: Currículum/Biografía

# NavSimpleMVC
source: Simple MVC
es: MVC Sencillo

# NavSimpleMVCRepo
source: Simple MVC Repository
es: Repositorio MVC Sencillo

# NavSimpleSignalR
source: Simple SignalR
es: SignalR Sencillo

# NavSimpleSignalRRepo
source: Simple SignalR Repository
es: Repositorio SignalR Sencillo

# NavThisRepo
source: This Repository
es: Este repositorio

# NavUsers
source: Users
es: Usuarios

# SubHeaderBio
source: "Never memorize something that you can look up." - <strong>Albert Einstein</strong>
es: "Nunca memorices algo que puedas buscar". - <strong>Albert Einstein</strong>

# SubHeaderContact
source: Send me an email the easy way. This form uses an endpoint in my API to send me an email.
es: Envíame un correo electrónico de la manera más fácil. Este formulario utiliza un punto final en mi API para enviarme un correo electrónico.

# SubHeaderStory
source: Unfortunately, last year I had a severe accident.
es: Desafortunadamente, el año pasado tuve un accidente grave.

# SubHeaderTech
source: <p> I created two tables in my database. Users and Events. They represent a common one-to-many relationship. </p> <p> The choice to use Users and Events was completely arbitrary. They are not tied to anything functional. So feel free to add, edit, or delete them without fear. </p>
es: <p> Creé dos tablas en mi base de datos. Usuarios y Eventos. Representan una relación común de uno a muchos. </p> <p> La elección de utilizar Usuarios y Eventos fue completamente arbitraria. No están atados a nada funcional. Así que siéntete libre de agregarlos, editarlos o eliminarlos sin miedo. </p>

# SubHeaderTechAPI
source: Access the API directly using its Swagger UI.
es: Acceda a la API directamente utilizando su interfaz de usuario Swagger.

# SubHeaderTechEvents
source: From here you can access all the events independently of users.
es: Desde aquí podrás acceder a todos los eventos independientemente de los usuarios.

# SubHeaderTechUsers
source: In a normal one-to-many flow. Things would start here.
es: En un flujo normal de uno a muchos. Las cosas empezarían aquí.

# SubHeaderWelcome
source: Welcome to <strong>Landed MVC!</strong>
es: ¡Bienvenido a <strong>Landed MVC!</strong>

# TextBio
source: As an autodidact software developer, I've been on a journey that began in childhood and spans two decades of experience in enterprise web software development. My coding journey has traversed a diverse landscape, from BASIC to C#. Beyond writing code, I'm an avid reader, and gamer.
es: Como desarrollador de software autodidacta, he emprendido un viaje que comenzó en la infancia y abarca dos décadas de experiencia en el desarrollo de software web empresarial. Mi viaje en codificación ha atravesado un panorama diverso, desde BASIC hasta C#. Más allá de escribir código, soy un ávido lector y jugador.

# TextSplash
source: And there are no hoverboards or flying cars.<br /> Just me and Landed MVC... &#128514;
es: Y no hay patinetas flotantes ni coches voladores.<br /> Sólo yo y Landed MVC... &#128514;

# TextStory
source: <p> I only bring this up because I have been out of work for a year. Mostly due to this accident and the time it has taken to recover. </p> <p> This has made me a bit rusty, and that has a lot to do with why these demo projects exist. They serve as both a refresher for my memory and a means to alleviate any concerns employers may have about my abilities. </p> <p> Well enough about me... </p>
es: <p> Sólo menciono esto porque llevo un año sin trabajo. Principalmente por este accidente y el tiempo que ha tardado en recuperarse. </p> <p> Esto me ha oxidado un poco y tiene mucho que ver con el motivo por el que existen estos proyectos de demostración. Sirven como un repaso de mi memoria y como un medio para aliviar cualquier preocupación que los empleadores puedan tener sobre mis habilidades. </p> <p> Bastante bien sobre mí... </p>

# TextWelcome1
source: This web application was built using .NET 8 MVC and some nice (and free) responsive design work from <a href="https://html5up.net/landed" target="_blank">HTML5 UP</a>. It looks best on a desktop, but is completely responsive to mobile screen sizes. Most of the credit for this lies in the design, but I've added a fair amount of JS and CSS myself.
es: Esta aplicación web se creó utilizando .NET 8 MVC y un excelente (y gratuito) trabajo de diseño responsivo de <a href="https://html5up.net/landed" target="_blank">HTML5 UP</a>. Se ve mejor en una computadora de escritorio, pero responde completamente a los tamaños de pantalla de los dispositivos móviles. La mayor parte del crédito por esto reside en el diseño, pero yo mismo agregué una buena cantidad de JS y CSS.

# TextWelcome2
source: It leverages a REST API for its backend, which is the same API utilized by my other demo applications. Consequently, modifications made here will seamlessly propagate to those applications, and vice versa. Embracing an API for the backend offers the flexibility to connect various frontends or implement alterations to them autonomously.
es: Aprovecha una API REST para su backend, que es la misma API utilizada por mis otras aplicaciones de demostración. En consecuencia, las modificaciones realizadas aquí se propagarán sin problemas a esas aplicaciones y viceversa. Adoptar una API para el backend ofrece la flexibilidad de conectar varios frontends o implementar modificaciones en ellos de forma autónoma.

# TitleHome
source: Home
es: Hogar
